is1200-example-projects/mcb32tools/headers/proc/p32mz2048ecg100.h
#define _IPC29_w_POSITION                        0x00000000
#define _IPC29_w_MASK                            0xFFFFFFFF
#define _IPC29_w_LENGTH                          0x00000020

#define _IPC30_CNCIS_POSITION                    0x00000000
#define _IPC30_CNCIS_MASK                        0x00000003
#define _IPC30_CNCIS_LENGTH                      0x00000002

#define _IPC30_CNCIP_POSITION                    0x00000002
#define _IPC30_CNCIP_MASK                        0x0000001C
#define _IPC30_CNCIP_LENGTH                      0x00000003

#define _IPC30_CNDIS_POSITION                    0x00000008
#define _IPC30_CNDIS_MASK                        0x00000300
#define _IPC30_CNDIS_LENGTH                      0x00000002

#define _IPC30_CNDIP_POSITION                    0x0000000A
#define _IPC30_CNDIP_MASK                        0x00001C00
#define _IPC30_CNDIP_LENGTH                      0x00000003

#define _IPC30_CNEIS_POSITION                    0x00000010
#define _IPC30_CNEIS_MASK                        0x00030000
#define _IPC30_CNEIS_LENGTH                      0x00000002

#define _IPC30_CNEIP_POSITION                    0x00000012
#define _IPC30_CNEIP_MASK                        0x001C0000
#define _IPC30_CNEIP_LENGTH                      0x00000003

#define _IPC30_CNFIS_POSITION                    0x00000018
#define _IPC30_CNFIS_MASK                        0x03000000
#define _IPC30_CNFIS_LENGTH                      0x00000002

#define _IPC30_CNFIP_POSITION                    0x0000001A
#define _IPC30_CNFIP_MASK                        0x1C000000
#define _IPC30_CNFIP_LENGTH                      0x00000003

#define _IPC30_w_POSITION                        0x00000000
#define _IPC30_w_MASK                            0xFFFFFFFF
#define _IPC30_w_LENGTH                          0x00000020

#define _IPC31_CNGIS_POSITION                    0x00000000
#define _IPC31_CNGIS_MASK                        0x00000003
#define _IPC31_CNGIS_LENGTH                      0x00000002

#define _IPC31_CNGIP_POSITION                    0x00000002
#define _IPC31_CNGIP_MASK                        0x0000001C
#define _IPC31_CNGIP_LENGTH                      0x00000003

#define _IPC31_w_POSITION                        0x00000000
#define _IPC31_w_MASK                            0xFFFFFFFF
#define _IPC31_w_LENGTH                          0x00000020

#define _IPC32_PMPIS_POSITION                    0x00000000
#define _IPC32_PMPIS_MASK                        0x00000003
#define _IPC32_PMPIS_LENGTH                      0x00000002

#define _IPC32_PMPIP_POSITION                    0x00000002
#define _IPC32_PMPIP_MASK                        0x0000001C
#define _IPC32_PMPIP_LENGTH                      0x00000003

#define _IPC32_PMPEIS_POSITION                   0x00000008
#define _IPC32_PMPEIS_MASK                       0x00000300
#define _IPC32_PMPEIS_LENGTH                     0x00000002

#define _IPC32_PMPEIP_POSITION                   0x0000000A
#define _IPC32_PMPEIP_MASK                       0x00001C00
#define _IPC32_PMPEIP_LENGTH                     0x00000003

#define _IPC32_CMP1IS_POSITION                   0x00000010
#define _IPC32_CMP1IS_MASK                       0x00030000
#define _IPC32_CMP1IS_LENGTH                     0x00000002

#define _IPC32_CMP1IP_POSITION                   0x00000012
#define _IPC32_CMP1IP_MASK                       0x001C0000
#define _IPC32_CMP1IP_LENGTH                     0x00000003

#define _IPC32_CMP2IS_POSITION                   0x00000018
#define _IPC32_CMP2IS_MASK                       0x03000000
#define _IPC32_CMP2IS_LENGTH                     0x00000002

#define _IPC32_CMP2IP_POSITION                   0x0000001A
#define _IPC32_CMP2IP_MASK                       0x1C000000
#define _IPC32_CMP2IP_LENGTH                     0x00000003

#define _IPC32_w_POSITION                        0x00000000
#define _IPC32_w_MASK                            0xFFFFFFFF
#define _IPC32_w_LENGTH                          0x00000020

#define _IPC33_USBIS_POSITION                    0x00000000
#define _IPC33_USBIS_MASK                        0x00000003
#define _IPC33_USBIS_LENGTH                      0x00000002

#define _IPC33_USBIP_POSITION                    0x00000002
#define _IPC33_USBIP_MASK                        0x0000001C
#define _IPC33_USBIP_LENGTH                      0x00000003

#define _IPC33_USBDMAIS_POSITION                 0x00000008
#define _IPC33_USBDMAIS_MASK                     0x00000300
#define _IPC33_USBDMAIS_LENGTH                   0x00000002

#define _IPC33_USBDMAIP_POSITION                 0x0000000A
#define _IPC33_USBDMAIP_MASK                     0x00001C00
#define _IPC33_USBDMAIP_LENGTH                   0x00000003

#define _IPC33_DMA0IS_POSITION                   0x00000010
#define _IPC33_DMA0IS_MASK                       0x00030000
#define _IPC33_DMA0IS_LENGTH                     0x00000002

#define _IPC33_DMA0IP_POSITION                   0x00000012
#define _IPC33_DMA0IP_MASK                       0x001C0000
#define _IPC33_DMA0IP_LENGTH                     0x00000003

#define _IPC33_DMA1IS_POSITION                   0x00000018
#define _IPC33_DMA1IS_MASK                       0x03000000
#define _IPC33_DMA1IS_LENGTH                     0x00000002

#define _IPC33_DMA1IP_POSITION                   0x0000001A
#define _IPC33_DMA1IP_MASK                       0x1C000000
#define _IPC33_DMA1IP_LENGTH                     0x00000003

#define _IPC33_w_POSITION                        0x00000000
#define _IPC33_w_MASK                            0xFFFFFFFF
#define _IPC33_w_LENGTH                          0x00000020

#define _IPC34_DMA2IS_POSITION                   0x00000000
#define _IPC34_DMA2IS_MASK                       0x00000003
#define _IPC34_DMA2IS_LENGTH                     0x00000002

#define _IPC34_DMA2IP_POSITION                   0x00000002
#define _IPC34_DMA2IP_MASK                       0x0000001C
#define _IPC34_DMA2IP_LENGTH                     0x00000003

#define _IPC34_DMA3IS_POSITION                   0x00000008
#define _IPC34_DMA3IS_MASK                       0x00000300
#define _IPC34_DMA3IS_LENGTH                     0x00000002

#define _IPC34_DMA3IP_POSITION                   0x0000000A
#define _IPC34_DMA3IP_MASK                       0x00001C00
#define _IPC34_DMA3IP_LENGTH                     0x00000003

#define _IPC34_DMA4IS_POSITION                   0x00000010
#define _IPC34_DMA4IS_MASK                       0x00030000
#define _IPC34_DMA4IS_LENGTH                     0x00000002

#define _IPC34_DMA4IP_POSITION                   0x00000012
#define _IPC34_DMA4IP_MASK                       0x001C0000
#define _IPC34_DMA4IP_LENGTH                     0x00000003

#define _IPC34_DMA5IS_POSITION                   0x00000018
#define _IPC34_DMA5IS_MASK                       0x03000000
#define _IPC34_DMA5IS_LENGTH                     0x00000002

#define _IPC34_DMA5IP_POSITION                   0x0000001A
#define _IPC34_DMA5IP_MASK                       0x1C000000
#define _IPC34_DMA5IP_LENGTH                     0x00000003

#define _IPC34_w_POSITION                        0x00000000
#define _IPC34_w_MASK                            0xFFFFFFFF
#define _IPC34_w_LENGTH                          0x00000020

